app/controllers/charge_controller.rb

SELECT * FROM `employees` WHERE (`employees`.`id` = 109)
SELECT * FROM `orders` WHERE (`orders`.employee_id = 109)
SELECT * FROM `customers` WHERE (id in (42,7,33,41,17,32,9) )
---
  def index

    employee_id = User.find(session[:user_id]).employee_id
    @employee = Employee.find(employee_id)

    orders =  @employee.orders
    customer_ids = orders.map{ |order| order.customer.id }.uniq