app/controllers/deliverable_controller.rb

SELECT * FROM `employees` WHERE (`employees`.`id` = 109)
SELECT * FROM `customers` WHERE (`customers`.`id` = 7)
SELECT * FROM `orders` WHERE (`orders`.`customer_id` = '7' AND `orders`.`employee_id` = '109')
---
  def index

    @employee = Employee.find(params[:employee_id])
    @customer = Customer.find(params[:customer_id])
    orders =  Order.find_all_by_customer_id_and_employee_id(params[:customer_id],params[:employee_id])