app/controllers/logins_controller.rb

  def index

    employee = Employee.find_by_id(params[:employee_id])
---
SELECT * FROM `employees` WHERE (`employees`.`id` IS NULL) LIMIT 1