app/controllers/stockout_controller.rb

  def search
    @stock_out_list = StockState.find_stock_out(params[:date])
---
SELECT * FROM `stock_states` WHERE (DATE_FORMAT(state_date, '%Y%m') = '200910') GROUP BY product_id

  def pdf
    @pdfs = []
    stock_out = StockState.find_stock_out_for_supplier(params[:date])
    stock_out.each_pair do |key, value|
      supplier = Supplier.find(key)
---
SELECT * FROM `stock_states` WHERE (DATE_FORMAT(state_date, '%Y%m') = '200910') GROUP BY product_id
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 2)

  def send_mail
    suppliers = params[:suppliers]
    puts "======="
    puts suppliers.inspect
    suppliers.each do |spl|
      puts spl.split(",").inspect
      supplier = Supplier.find(spl.split(",").last)
---
SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 2)